Repository: GiannisTsim/OrderManager
Catalog: src/Localization/Resources/Retailer/RetailerResource.*.resx
Languages: el

# Retailer.TaxId
source: Taxpayer Identification Number (TIN)
el: Αριθμός Φορολογικού Μητρώου (ΑΦΜ)

# Retailer.TaxIdAbbreviation
source: TIN
el: ΑΦΜ

# Retailer.Name
source: Name
el: Όνομα

# Retailer.InvalidTaxId
source: Invalid TIN.
el: Μη έγκυρο ΑΦΜ.

# Retailer.InvalidName
source: Invalid name.
el: Μη έγκυρο όνομα.

# Retailer.DuplicateTaxId
source: There is already a retailer with the same TIN.
el: Υπάρχει ήδη ένας προμηθευτής με αυτό το ΑΦΜ.

# Retailer.DuplicateName
source: There is already a retailer with the same name.
el: Υπάρχει ήδη ένας προμηθευτής με αυτό το όνομα.

# Retailer.CurrencyLost
source: Retailer was already modified by another user.
el: Ο προμηθευτής έχει ήδη τροποποιηθεί από κάποιον άλλο χρήστη.

# Retailer.NotFound
source: Retailer does not exist.
el: Ο προμηθευτής δεν βρέθηκε.

# Retailer.AddSuccess
source: Retailer added successfully.
el: Ο προμηθευτής προστέθηκε επιτυχώς.

# Retailer.ModifySuccess
source: Retailer modified successfully.
el: Ο προμηθευτής τροποποιήθηκε επιτυχώς.
